// Задача 1 

// В одномерном массиве, состоящем из n вещественных элементов, вычислите 
// номер минимального элемента массива и сумму элементов массива, 
// расположенных между первым и вторым отрицательными элементами.
// Задача 2 
var arr = [];

// Дана строка S (Пользователь вводит с клавиатуры)
// Найти в строке все заданные последовательности символов и заменить 
// их другой последовательностью.
// Замечание: Последовательности символом пользователь вводит с клавиатуры.
// 2-я задача
for (let i = 0; i < 5; i++) {
    arr[i] = prompt('Введите последовательноть символов');

}
document.write(arr.reverse());

